app/controllers/home_controller.rb

SELECT "tasks".* FROM "tasks" WHERE (user_id = 1) AND (duedate != '2018-03-22') ORDER BY description desc
SELECT "tasks".* FROM "tasks" ORDER BY description desc
SELECT COUNT(*) FROM "tasks" WHERE (user_id = 1 AND duedate != '2018-03-26' AND title ILIKE '%%')
SELECT  "tasks".* FROM "tasks" WHERE (user_id = 1 AND duedate != '2018-03-26' AND title ILIKE '%%') ORDER BY description asc LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
---
	def index
    @tasks_duetoday = Task.where("duedate = '#{Date.today.strftime('%Y-%m-%d')}' AND user_id = #{current_user.id} AND status = 'Open'")
    flash[:alert] = "You have #{@tasks_duetoday.length} tasks open duetoday"

		@tasks = Task.where("user_id = #{current_user.id} AND duedate != '#{Date.today.strftime('%Y-%m-%d')}' AND title ILIKE '%#{params[:search]}%'").order("#{sort_column} #{sort_direction}").paginate(:per_page => 5, :page => params[:page])