app/controllers/tasks_controller.rb

	def create
		@task = Task.new(resource_params)
		if @task.save
---
INSERT INTO "tasks" ("title", "description", "duedate", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test"], ["description", "test aja"], ["duedate", "2018-03-23"], ["created_at", "2018-03-23 06:24:19.947496"], ["updated_at", "2018-03-23 06:24:19.947496"], ["user_id", 1]]

	def update
		@task = Task.find(params[:id])
		if @task.update(resource_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "Membuat sebuah aplikasi web denagn RoR\r\n"], ["updated_at", "2018-03-17 20:39:51.820174"], ["id", 1]]